examples/performance/java-lambda-optimization/measurements/final/uc3-standard-run1-20260318-083328.txt

Summary:
  Total:	30.9124 secs
  Slowest:	9.0789 secs
  Fastest:	0.0775 secs
  Average:	0.1483 secs
  Requests/sec:	64.5372
  
  Total data:	329217 bytes
  Size/request:	165 bytes

Response time histogram:
  0.077 [1]	|
  0.978 [1989]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  1.878 [0]	|
  2.778 [1]	|
  3.678 [1]	|
  4.578 [0]	|
  5.478 [0]	|
  6.378 [0]	|
  7.279 [2]	|
  8.179 [0]	|
  9.079 [1]	|


Latency distribution:
  10%% in 0.0875 secs
  25%% in 0.0919 secs
  50%% in 0.1150 secs
  75%% in 0.1744 secs
  90%% in 0.1778 secs
  95%% in 0.2068 secs
  99%% in 0.3511 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0007 secs, 0.0000 secs, 0.0915 secs
  DNS-lookup:	0.0001 secs, 0.0000 secs, 0.0117 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0008 secs
  resp wait:	0.1475 secs, 0.0773 secs, 9.0788 secs
  resp read:	0.0001 secs, 0.0000 secs, 0.0014 secs

Status code distribution:
  [200]	1995 responses