examples/performance/java-lambda-optimization/measurements/final/uc3-standard-run2-20260318-083328.txt

Summary:
  Total:	17.7723 secs
  Slowest:	0.3503 secs
  Fastest:	0.0759 secs
  Average:	0.1294 secs
  Requests/sec:	112.2533
  
  Total data:	329193 bytes
  Size/request:	165 bytes

Response time histogram:
  0.076 [1]	|
  0.103 [962]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.131 [117]	|■■■■■
  0.158 [213]	|■■■■■■■■■
  0.186 [593]	|■■■■■■■■■■■■■■■■■■■■■■■■■
  0.213 [60]	|■■
  0.241 [18]	|■
  0.268 [8]	|
  0.295 [3]	|
  0.323 [15]	|■
  0.350 [5]	|


Latency distribution:
  10%% in 0.0847 secs
  25%% in 0.0889 secs
  50%% in 0.1089 secs
  75%% in 0.1741 secs
  90%% in 0.1775 secs
  95%% in 0.1903 secs
  99%% in 0.3196 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0006 secs, 0.0000 secs, 0.0906 secs
  DNS-lookup:	0.0001 secs, 0.0000 secs, 0.0120 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0051 secs
  resp wait:	0.1286 secs, 0.0757 secs, 0.3500 secs
  resp read:	0.0001 secs, 0.0000 secs, 0.0058 secs

Status code distribution:
  [200]	1995 responses