examples/performance/java-lambda-optimization/measurements/final/uc3-standard-run3-20260318-083328.txt

Summary:
  Total:	17.3226 secs
  Slowest:	0.4458 secs
  Fastest:	0.0739 secs
  Average:	0.1265 secs
  Requests/sec:	115.1673
  
  Total data:	329185 bytes
  Size/request:	165 bytes

Response time histogram:
  0.074 [1]	|
  0.111 [1067]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.148 [256]	|■■■■■■■■■■
  0.185 [569]	|■■■■■■■■■■■■■■■■■■■■■
  0.223 [44]	|■■
  0.260 [24]	|■
  0.297 [3]	|
  0.334 [26]	|■
  0.371 [4]	|
  0.409 [0]	|
  0.446 [1]	|


Latency distribution:
  10%% in 0.0832 secs
  25%% in 0.0875 secs
  50%% in 0.1017 secs
  75%% in 0.1735 secs
  90%% in 0.1773 secs
  95%% in 0.1858 secs
  99%% in 0.3113 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0006 secs, 0.0000 secs, 0.0847 secs
  DNS-lookup:	0.0001 secs, 0.0000 secs, 0.0127 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0011 secs
  resp wait:	0.1257 secs, 0.0738 secs, 0.4456 secs
  resp read:	0.0001 secs, 0.0000 secs, 0.0041 secs

Status code distribution:
  [200]	1995 responses